package side.mimi.mdd.utils;

import java.util.Random;

public class CombineRandomNickname {
	String[] adjectives = {
			"가난한", "가벼운", "가을의", "감동적인", "감성적인", "강한", "거대한", "건강한", "겨울의", "곁에있고픈", "고대의", "고민하는",
			"고요한", "고유한", "곤란한", "구월의", "구체적인", "궁극적인", "귀여운", "귀중한", "귀찮은", "그냥", "그래도", "그래봤자",
			"그럼에도", "그렇지만", "그리고", "그리운", "그리워하는", "근엄한", "긍정적인", "기다리는", "기쁜", "기운찬", "길조있는", "까만",
			"깨끗한", "꽃같은", "꿈꾸는", "꿈꾸던", "꿈꿔왔던", "꿈에서깬", "끈기있는", "끈임없는", "낙관적인", "낙천적인", "날카로운",
			"남아있는", "낮은", "낮의", "내일까지", "내일의", "냉소적인", "냉정한", "널좋아하는", "널좋아하던", "노란", "노래하는", "놀라운",
			"농성하는", "높은", "느린", "늘보고싶은", "능숙한", "늦은", "늦잠을잔", "니가좋아", "다지운", "단순한", "단호한", "달콤한",
			"닮고싶은", "답답한", "당당한", "당신의", "당연한", "대단한", "더이상은", "도전적인", "독보적인", "독특한", "둔한", "든든한",
			"따끈따끈한", "따뜻한", "뛰어난", "막적어넣은", "만족스러운", "맑은", "맛있는", "매력적인", "멋대로인", "멋들어진", "멋부리는",
			"멋진", "명확한", "모델포즈의", "모레의", "모범적인", "모험적인", "무거운", "무기력한", "무뚝뚝한", "무심한", "무작위의",
			"무지한", "무한한", "미소지은", "바쁜", "밖의", "발전적인", "밝은", "밤공기의", "밤의", "방금일어난", "배부른", "배울만한",
			"봄의", "부끄러운", "부드러운", "비싼", "비판적인", "빛나는", "빠른", "빨간", "뻔한", "사랑스러운", "사랑에빠진", "사랑의",
			"사월의", "사진찍는", "살기좋은", "삼월의", "상냥한", "상상도못할", "상상속의", "새벽의", "생각보다", "생생한", "서운한",
			"서있는", "섞인", "설레는", "성공적인", "성급한", "성숙한", "성실한", "세련된", "센스있는", "소개받은", "소중한", "솔직한",
			"스산한", "스스럼없는", "슬기로운", "승리한", "시간이남는", "시원한", "시월의", "신나는", "신비로운", "신선한", "신성한",
			"신중한", "실용적인", "심심한", "십이월의", "십일월의", "아름다운", "아침의", "안전한", "안정된", "애인의", "어떤날의",
			"어려운", "어제보다", "어제의", "어쩔수없는", "언젠가", "얼굴이빨간", "에프인", "여름의", "여름이었던", "연결성있는", "열렬한",
			"열심히하는", "열정적인", "영광스러운", "예쁜", "예의바른", "오늘의", "오래된", "오래참는", "오월의", "오전의", "온유한",
			"완벽한", "용기있는", "용서하는", "울기싫은", "웃고있는", "웃긴", "원기왕성한", "유능한", "유려한", "유용한", "유월의", "유쾌한",
			"의미있는", "의심하는", "이로운", "이롭게하는", "이미떠난", "이상적인", "이성적인", "이월의", "이제생겨난", "익명의", "인기있는",
			"인내하는", "인사하는", "일월의", "자랑스러운", "자비로운", "자상한", "자신감있는", "자신있는", "자애로운", "자연스러운",
			"자유로운", "자유분방한", "자주하는", "작은", "잘 풀리는", "잘난척하는", "잘빠진", "잘생긴", "잠자는", "재미있는", "저멀리있는",
			"적극적인", "전략적인", "전문적인", "정오의", "정의로운", "정의의", "정적인", "정점의", "정직한", "조용한", "좋아하는", "좋은",
			"즐거운", "지적인", "지혜로운", "직관적인", "진지한", "질투스러운", "질투하는", "착한", "참을성있는", "창의적인", "창조적인",
			"천재적인", "청결한", "초록의", "최고의", "축하의", "춤추는", "충분한", "친근한", "친절한", "칠월의", "커진", "쾌활한", "크나큰",
			"탄탄한", "파란", "파워풀한", "판단력있는", "팔방미인인", "팔월의", "편안한", "평화로운", "포용력있는", "폭소의", "하얀",
			"합리적인", "행복한", "행운의", "혁신적인", "현명한", "현실감있는", "협력적인", "혼신의", "혼자있는", "화려한", "확실한",
			"환상적인", "환호하는", "활기찬", "효과적인", "훌륭한", "흥미로운", "희생적인"
	};

	String[] nouns = {
			"가래떡", "가루떡", "가방", "가위", "가자미", "가재", "가지", "갈매기살", "갈비", "갈치", "감", "감자", "감자칩", "갑오징어",
			"개똥지", "개미", "거지함", "건두", "건포도", "게", "계란", "고구마", "고구마칩", "고기", "고등어", "고라니", "고래", "고수",
			"고슴도치", "고추", "고추가루", "고추장", "곰국", "곳간구이", "공책", "광어", "국수", "굴", "굴비", "굴소스", "귤", "그릇",
			"금태", "기름", "김", "김말이", "김밥", "김치", "깍두기", "깻잎", "꼬막", "꽁치", "꽃", "꽃게", "꽃오리걸", "꿀", "꿀벌",
			"나그네", "나비", "낙과연두", "난초", "낫또", "노트북", "논마이", "느타리버섯", "단팥", "단호땡", "단호박", "단호박스푼",
			"단호박시럽", "단호박죽", "달걀", "닭가슴살", "닭갈비", "닭고기", "닭곰탕", "닭꼬치", "닭발", "닭뼈", "담배", "당근", "대구",
			"대파", "대하", "대하표혈", "도토리", "독사편지", "돌쇠아가리", "돗단배", "동치미", "동태", "돼지고기", "두리안", "두부",
			"두부요리", "둑덕둑비", "드레스", "딸기", "딸기잼", "떡", "떡볶이", "라디오", "라면", "랍스타", "랍스터", "레몬", "리본",
			"리어카", "리치", "마늘", "마를소리", "마요네즈", "마우스", "마이크", "마카롱", "막대기", "만두", "맛살", "망고",
			"망고스틴", "맥주", "맥주병", "메로나", "메론", "메밀", "메츄리", "면", "명태", "모자", "무", "문어", "물병", "물풍선",
			"미역", "민들레잎", "밀", "밀가루", "바나나", "바다", "바위냄비", "바젤름", "바지", "바지락", "반임역견", "발효", "밤",
			"방석", "방어", "방패", "배", "배추", "배추김치", "뱀부추", "버섯", "버섯국", "버터", "베이컨", "보드게임", "보리", "복분자",
			"복숭아", "볶음라면", "볶음밥", "부추", "북두칠성", "불꽃", "브로콜리", "브린지", "블루베리", "비디오", "비밀노트", "비행기",
			"빵", "사과", "사이렌", "사자", "사진기", "사해", "산낙지", "산도", "삼겹살", "삼치", "상어", "상추", "새", "새송이버섯",
			"새우", "샐러리", "생강", "생김치", "생선", "석류", "설탕", "설탕수저", "소고기", "소금", "소금물", "소독약", "소라", "소세지",
			"소스", "소주", "속으로할말", "손목시계", "손수건", "송아지", "쇠고기", "쇠고기국", "수박", "수수", "수저", "숟가락",
			"스마트폰", "스케치북", "스타로드", "스테이크", "스틱", "스파게티", "스펀지", "스피커", "시금치", "시리얼", "식빵", "신문",
			"신발", "쌀", "쌀가루", "쌀국수", "쑥", "씨암씨", "아몬드", "아몬드밀크", "아이스크림", "아이언맨", "안경", "안테나", "알밤",
			"야채", "야채샐러드", "양고기", "양떼", "양말", "양배추", "양양", "양장피", "양파", "어묵", "연근", "연어", "연필", "영화",
			"오두막", "오디오", "오락실", "오리고기", "오이", "오징어", "오후", "옥수수", "와니밍", "완두콩", "요구르트", "요정", "용암",
			"우엉", "우유", "육개장", "육포", "의자", "인력거", "인삼", "일기장", "일상", "잉어", "자두", "자두마쵸", "잡지", "장미",
			"쟁반", "전광판", "전복", "점핑", "접시", "젓가락", "젓갈", "조", "조개", "종이", "종이비행기", "종이컵", "주먹밥", "줄기말이",
			"지도", "지평선", "짜장면", "짬뽕", "차", "차떡", "참외", "참치", "찹쌀", "책", "천사", "체리", "초밥", "초코볼", "치즈",
			"카드", "카드게임", "카레", "카메라", "칼국수", "커피", "컴퓨터", "컵", "케이크", "코알라", "코코넛", "코코볼", "콘후스",
			"콜라", "콩", "콩나물", "크레세이프", "크레파스", "키보드", "키위", "탕수육", "테이블", "텔레비전", "토르", "토마토",
			"토마토소스", "토스트", "통닭", "트러플", "티셔츠", "파스타", "파인애플", "팔보채", "팥", "팥빙수", "평양냉면", "포도",
			"포크", "풋사과", "풍선", "플라스틱", "피망", "피자", "필통", "하늘", "핫도그", "해물파전", "해바라기", "해삼", "해적",
			"해파리", "햄", "햄버거", "향신료", "허브", "헬리콥터", "호두", "호랑이", "호박", "호박고구마", "홍삼", "홍합", "후추", "흑임자",
	};

	public String getRandomNickname() {
		Random random = new Random();

		int adjIndex = random.nextInt(adjectives.length);
		int nounIndex = random.nextInt(nouns.length);

		return adjectives[adjIndex] + nouns[nounIndex];
	}
}
